; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-6-13)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	plane6 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	city16 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city13)
	(fuel-level plane1 fl4)
	(at plane2 city10)
	(fuel-level plane2 fl3)
	(at plane3 city14)
	(fuel-level plane3 fl4)
	(at plane4 city12)
	(fuel-level plane4 fl5)
	(at plane5 city7)
	(fuel-level plane5 fl0)
	(at plane6 city7)
	(fuel-level plane6 fl3)
	(at person1 city16)
	(at person2 city2)
	(at person3 city5)
	(at person4 city12)
	(at person5 city16)
	(at person6 city9)
	(at person7 city0)
	(at person8 city5)
	(at person9 city3)
	(at person10 city7)
	(at person11 city16)
	(at person12 city13)
	(at person13 city4)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane1 city0)
	(at plane2 city4)
	(at plane4 city5)
	(at person1 city4)
	(at person2 city11)
	(at person3 city10)
	(at person4 city13)
	(at person5 city8)
	(at person6 city7)
	(at person7 city12)
	(at person9 city14)
	(at person10 city0)
	(at person11 city0)
	(at person12 city2)
	(at person13 city8)
	))

)

; plan
1. (board person10 plane6 city7)
   deleted: (at person10 city7)
   added: (in person10 plane6)
   goals met: 0 of 15
2. (zoom plane6 city7 city0 fl3 fl2 fl1)
   deleted: (at plane6 city7) (fuel-level plane6 fl3)
   added: (at plane6 city0) (fuel-level plane6 fl1)
   goals met: 0 of 15
3. (board person7 plane6 city0)
   deleted: (at person7 city0)
   added: (in person7 plane6)
   goals met: 0 of 15
4. (debark person10 plane6 city0)
   deleted: (in person10 plane6)
   added: (at person10 city0)
   goals met: 1 of 15
5. (fly plane6 city0 city12 fl1 fl0)
   deleted: (at plane6 city0) (fuel-level plane6 fl1)
   added: (at plane6 city12) (fuel-level plane6 fl0)
   goals met: 1 of 15
6. (debark person7 plane6 city12)
   deleted: (in person7 plane6)
   added: (at person7 city12)
   goals met: 2 of 15
7. (zoom plane4 city12 city16 fl5 fl4 fl3)
   deleted: (at plane4 city12) (fuel-level plane4 fl5)
   added: (at plane4 city16) (fuel-level plane4 fl3)
   goals met: 2 of 15
8. (board person4 plane6 city12)
   deleted: (at person4 city12)
   added: (in person4 plane6)
   goals met: 2 of 15
9. (refuel plane6 city12 fl0 fl1)
   deleted: (fuel-level plane6 fl0)
   added: (fuel-level plane6 fl1)
   goals met: 2 of 15
10. (fly plane6 city12 city13 fl1 fl0)
   deleted: (at plane6 city12) (fuel-level plane6 fl1)
   added: (at plane6 city13) (fuel-level plane6 fl0)
   goals met: 2 of 15
11. (debark person4 plane6 city13)
   deleted: (in person4 plane6)
   added: (at person4 city13)
   goals met: 3 of 15
12. (board person5 plane4 city16)
   deleted: (at person5 city16)
   added: (in person5 plane4)
   goals met: 3 of 15
13. (board person11 plane4 city16)
   deleted: (at person11 city16)
   added: (in person11 plane4)
   goals met: 3 of 15
14. (zoom plane4 city16 city5 fl3 fl2 fl1)
   deleted: (at plane4 city16) (fuel-level plane4 fl3)
   added: (at plane4 city5) (fuel-level plane4 fl1)
   goals met: 4 of 15
15. (board person3 plane4 city5)
   deleted: (at person3 city5)
   added: (in person3 plane4)
   goals met: 4 of 15
16. (zoom plane2 city10 city16 fl3 fl2 fl1)
   deleted: (at plane2 city10) (fuel-level plane2 fl3)
   added: (at plane2 city16) (fuel-level plane2 fl1)
   goals met: 4 of 15
17. (board person1 plane2 city16)
   deleted: (at person1 city16)
   added: (in person1 plane2)
   goals met: 4 of 15
18. (fly plane2 city16 city4 fl1 fl0)
   deleted: (at plane2 city16) (fuel-level plane2 fl1)
   added: (at plane2 city4) (fuel-level plane2 fl0)
   goals met: 5 of 15
19. (board person13 plane2 city4)
   deleted: (at person13 city4)
   added: (in person13 plane2)
   goals met: 5 of 15
20. (refuel plane2 city4 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 5 of 15
21. (debark person1 plane2 city4)
   deleted: (in person1 plane2)
   added: (at person1 city4)
   goals met: 6 of 15
22. (board person12 plane1 city13)
   deleted: (at person12 city13)
   added: (in person12 plane1)
   goals met: 6 of 15
23. (zoom plane1 city13 city0 fl4 fl3 fl2)
   deleted: (at plane1 city13) (fuel-level plane1 fl4)
   added: (at plane1 city0) (fuel-level plane1 fl2)
   goals met: 7 of 15
24. (zoom plane3 city14 city2 fl4 fl3 fl2)
   deleted: (at plane3 city14) (fuel-level plane3 fl4)
   added: (at plane3 city2) (fuel-level plane3 fl2)
   goals met: 7 of 15
25. (board person2 plane3 city2)
   deleted: (at person2 city2)
   added: (in person2 plane3)
   goals met: 7 of 15
26. (zoom plane3 city2 city11 fl2 fl1 fl0)
   deleted: (at plane3 city2) (fuel-level plane3 fl2)
   added: (at plane3 city11) (fuel-level plane3 fl0)
   goals met: 7 of 15
27. (debark person2 plane3 city11)
   deleted: (in person2 plane3)
   added: (at person2 city11)
   goals met: 8 of 15
28. (fly plane2 city4 city8 fl1 fl0)
   deleted: (at plane2 city4) (fuel-level plane2 fl1)
   added: (at plane2 city8) (fuel-level plane2 fl0)
   goals met: 7 of 15
29. (refuel plane2 city8 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 7 of 15
30. (debark person13 plane2 city8)
   deleted: (in person13 plane2)
   added: (at person13 city8)
   goals met: 8 of 15
31. (fly plane2 city8 city4 fl1 fl0)
   deleted: (at plane2 city8) (fuel-level plane2 fl1)
   added: (at plane2 city4) (fuel-level plane2 fl0)
   goals met: 9 of 15
32. (zoom plane1 city0 city2 fl2 fl1 fl0)
   deleted: (at plane1 city0) (fuel-level plane1 fl2)
   added: (at plane1 city2) (fuel-level plane1 fl0)
   goals met: 8 of 15
33. (refuel plane1 city2 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 8 of 15
34. (debark person12 plane1 city2)
   deleted: (in person12 plane1)
   added: (at person12 city2)
   goals met: 9 of 15
35. (fly plane1 city2 city3 fl1 fl0)
   deleted: (at plane1 city2) (fuel-level plane1 fl1)
   added: (at plane1 city3) (fuel-level plane1 fl0)
   goals met: 9 of 15
36. (refuel plane1 city3 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 9 of 15
37. (board person9 plane1 city3)
   deleted: (at person9 city3)
   added: (in person9 plane1)
   goals met: 9 of 15
38. (fly plane1 city3 city14 fl1 fl0)
   deleted: (at plane1 city3) (fuel-level plane1 fl1)
   added: (at plane1 city14) (fuel-level plane1 fl0)
   goals met: 9 of 15
39. (refuel plane1 city14 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 9 of 15
40. (debark person9 plane1 city14)
   deleted: (in person9 plane1)
   added: (at person9 city14)
   goals met: 10 of 15
41. (fly plane1 city14 city9 fl1 fl0)
   deleted: (at plane1 city14) (fuel-level plane1 fl1)
   added: (at plane1 city9) (fuel-level plane1 fl0)
   goals met: 10 of 15
42. (refuel plane1 city9 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 10 of 15
43. (board person6 plane1 city9)
   deleted: (at person6 city9)
   added: (in person6 plane1)
   goals met: 10 of 15
44. (fly plane1 city9 city7 fl1 fl0)
   deleted: (at plane1 city9) (fuel-level plane1 fl1)
   added: (at plane1 city7) (fuel-level plane1 fl0)
   goals met: 10 of 15
45. (refuel plane1 city7 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 10 of 15
46. (debark person6 plane1 city7)
   deleted: (in person6 plane1)
   added: (at person6 city7)
   goals met: 11 of 15
47. (fly plane1 city7 city0 fl1 fl0)
   deleted: (at plane1 city7) (fuel-level plane1 fl1)
   added: (at plane1 city0) (fuel-level plane1 fl0)
   goals met: 12 of 15
48. (fly plane4 city5 city0 fl1 fl0)
   deleted: (at plane4 city5) (fuel-level plane4 fl1)
   added: (at plane4 city0) (fuel-level plane4 fl0)
   goals met: 11 of 15
49. (refuel plane4 city0 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 11 of 15
50. (debark person11 plane4 city0)
   deleted: (in person11 plane4)
   added: (at person11 city0)
   goals met: 12 of 15
51. (fly plane4 city0 city10 fl1 fl0)
   deleted: (at plane4 city0) (fuel-level plane4 fl1)
   added: (at plane4 city10) (fuel-level plane4 fl0)
   goals met: 12 of 15
52. (refuel plane4 city10 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 12 of 15
53. (debark person3 plane4 city10)
   deleted: (in person3 plane4)
   added: (at person3 city10)
   goals met: 13 of 15
54. (fly plane4 city10 city8 fl1 fl0)
   deleted: (at plane4 city10) (fuel-level plane4 fl1)
   added: (at plane4 city8) (fuel-level plane4 fl0)
   goals met: 13 of 15
55. (refuel plane4 city8 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 13 of 15
56. (debark person5 plane4 city8)
   deleted: (in person5 plane4)
   added: (at person5 city8)
   goals met: 14 of 15
57. (fly plane4 city8 city5 fl1 fl0)
   deleted: (at plane4 city8) (fuel-level plane4 fl1)
   added: (at plane4 city5) (fuel-level plane4 fl0)
   goals met: 15 of 15
